{
  "ACTION": {
    "GET": "Truy vấn {name} không thành công.",
    "CREATE": "Tạo {name} không thành công.",
    "UPDATE": "Cập nhật {name} không thành công.",
    "DELETE": "Xóa {name} không thành công.",
    "ACTIVE": "Kích hoạt {name} không thành công.",
    "INACTIVE": "Hủy kích hoạt {name} không thành công.",
    "CHANGE_STATUS": "Thay đổi trạng thái {name} không thành công."
  },
  "alert_password_wrong": "Tên đăng nhập hoặc mật khẩu bạn nhập không đúng !",
  "alert_company_inactive": "Công ty không hoạt động !",
  "alert_group_inactive": "Nhóm không hoạt động !",
  "alert_user_inactive": "Người dùng không hoạt động !",
  "alert_user_not_group": "Người dùng chưa gán nhóm !",
  "denied_access": "Bạn không có quyền truy cập vào trang này !",
  "denied_update": "Bạn không có quyền cập nhật dữ liệu này !",
  "denied_create": "Bạn không có quyền tạo mới dữ liệu này !",
  "denied_delete": "Bạn không có quyền xoá dữ liệu này !",
  "E0001": "Vị trí thực hiện so với vị trí cửa hàng {parameter1} không nằm trong khoảng cách {parameter2} cho phép.",
  "E0002": "Tạo bày hàng không thành công, Trùng dữ liệu tạo bày hàng trong ngày.",
  "E0003": "Cửa hàng không tồn tại.",
  "E0004": "Không tồn tại File upload.",
  "E0005": "Số điện thoại chưa đăng ký.",
  "E0006": "Tài khoản chưa kích hoạt hoặc đã hết hạn.",
  "E0007": "Cửa hàng đã tồn tại gán nhiệm vụ.",
  "E0008": "Cửa hàng đã viếng thăm.",
  "E0009": "Cửa hàng không nằm trong tuyến viếng thăm.",
  "E0010": "Cửa hàng đã thực hiện rời khỏi viếng thăm.",
  "E0011": "Cửa hàng chưa thực hiện viếng thăm.",
  "E0012": "Không tồn tại viếng thăm cửa hàng.",
  "E0013": "Không tìm thấy vị trí trên bản đồ của địa chỉ.",
  "E0014": "Nhân viên đã tồn tại trong nhóm khác.",
  "E0015": "Danh sách cửa hàng không tồn tại.",
  "E0016": "Tin tức không tồn tại hoặc đã gửi xong.",
  "E0017": "Tin nhắn không tồn tại hoặc đã gửi xong.",
  "E0018": "Có lỗi xảy ra. Vui lòng kiểm tra lại.",
  "E0019": "Nhân viên đã tồn tại trong tuyến khác.",
  "E0020": "Vui lòng đăng nhập lại.",
  "E0021": "Vui lòng thực hiện rời cửa hàng trước khi vào cửa hàng mới.",
  "E0022": "Công ty không tồn tại trên hệ thống.",
  "E0023": "Vui lòng điền đầy đủ thông tin.",
  "E0024": "Tên cửa hàng bị trùng. Vui lòng nhập tên khác.",
  "E0025": "Cửa hàng đã tồn tại trong một tuyến khác, Không được thực hiện cập nhật tuyến này.",
  "E0026": "Tên hoặc mã danh mục chỉ tiêu bị trùng. Vui lòng nhập tên khác.",
  "E0027": "Nhân viên không tồn tại.",
  "E0028": "Bộ chỉ tiêu đã tồn tại trong danh sách giao",
  "E0029": "Thành viên đang thuộc trong một phiếu giao khác",
  "E0030": "Tạo người dùng không thành công, vui lòng kiểm tra lại thông tin.",
  "E0031": "Tổng độ quan trọng (%) phải bằng 100%.",
  "E0032": "Mục tiêu phải luôn lớn hơn 0.",
  "E0033": "Vui lòng chọn danh mục chỉ tiêu.",
  "E0034": "Tên cửa hàng đã tồn tại trong một nhiệm vụ khác",
  "E0035": "Nhiệm vụ bị trùng khi tạo nhóm nhiệm vụ. Vui lòng kiểm tra lại.",
  "E0036": "Nhiệm vụ đã tồn tại trong công ty.",
  "E0037": "Vui chọn một nhóm.",
  "E0038": "Vui lòng cập nhật địa chỉ cửa hàng.",
  "E0039": "Mã tham chiếu không hợp lệ. Vui lòng kiểm tra lại.",
  "E0040": "Tên nhóm đã bị trùng. Vui lòng nhập tên khác.",
  "E0041": "Trưởng nhóm đã tồn tại trong nhóm khác, vui lòng kiểm tra lại.",
  "E0042": "Tên tuyến đã bị trùng. Vui lòng nhập tên khác.",
  "E0043": "Vui lòng chọn Nhà phân phối.",
  "E0044": "Người dùng đã được xét kpi",
  "E0045": "Nhóm không tồn tại",
  "E0046": "Nhóm đã được xét kpi",
  "E0047": "Giao KPI đã tồn tại trong một nhiệm vụ khác",
  "E0048": "Vui lòng chọn Loại đồng bộ.",
  "E0049": "Vui lòng chọn Công ty.",
  "E0050": "Vui lòng chọn Cửa hàng.",
  "E0051": "Nhà phân phối không tồn tại trên hệ thống.",
  "E0052": "Người dùng đang tồn tại trong một nhóm. Bạn không thể thay đổi role.",
  "E0053": "Tên vùng đã bị trùng. Vui lòng nhập tên khác.",
  "E0054": "Trưởng vùng đã tồn tại trong vùng khác, vui lòng kiểm tra lại.",
  "E0055": "Nhóm gán vào vùng đã tồn tại trong vùng khác, vui lòng kiểm tra lại.",
  "E0056": "Nhà phân phối không thuộc công ty. Vui lòng kiểm tra lại.",
  "E0057": "Cửa hàng không thuộc công ty. Vui lòng kiểm tra lại.",
  "E0058": "Cửa hàng đã tồn tại trong nhóm khác.",
  "E0059": "Quy tắc đã tồn tại trong nhóm khác.",
  "E0060": "Quy tắc đã tồn tại trong nhiệm vụ khác.",
  "E0061": "Quy tắc đã tồn tại trong tuyến khác",
  "E0062": "Vui lòng kiểm tra lại cấu hình.",
  "E0063": "Cửa hàng #{parameter1} {parameter2} đã tồn tại trong tuyến đang hoạt động.",
  "E0064": "Người dùng #{parameter1} {parameter2} đang ở trong Nhóm hoặc Định tuyến đang hoạt động.",
  "E0065": "Người dùng #{parameter1} {parameter2} đang trong trạng thái không hoạt động.",
  "E0066": "Đang xử lý 1 tiến trình đồng bộ. Vui lòng thử lại!.",
  "E0067": "Nhóm #{parameter1} {parameter2} đang trong trạng thái không hoạt động.",
  "E0068": "Sao chép thất bại.",
  "E0069": "Người dùng #{parameter1} {parameter2} đang ở định tuyến đang hoạt động.",
  "E0070": "Import thất bại.",
  "E0071": "Import không đúng định dạng file mẫu hoặc chưa thêm đủ dữ liệu vào file.",
  "E0072": "Nhóm {parameter1} đã tồn tại trong nhiệm vụ khác.",
  "E0073": "Tên nhóm nhiệm vụ đã bị trùng. Vui lòng nhập tên khác.",
  "E0074": "Nhóm {parameter1} đã tồn tại trong danh sách giao kpi khác.",
  "E0075": "Không thể đồng bộ cửa hàng. Vui lòng kiểm tra lại cấu hình.",
  "E0076": "Vui lòng chọn Sản phẩm.",
  "E0077": "{parameter} không tồn tại.",
  "E0078": "{parameter1} đã tồn tại trong một {parameter2} khác",
  "E0079": "Không thành công. Có lỗi xảy ra.",
  "E0080": "Cập nhật nhóm nhiệm vụ không thành công, vui lòng kiểm tra lại.",
  "E0081": "Mã #{parameter} đã tồn tại trong công ty",
  "E0082": "Chương trình đang hoạt động",
  "E0083": "Chương trình không tồn tại",
  "E0084": "Cửa hàng đã tham gia chương trình",
  "E0086": "Hạn mức nhận thưởng không hợp lệ",
  "E0087": "Chương trình này không được thay đổi hạn mức",
  "E0088": "Không tìm thấy cửa hàng tham gia chương trình",
  "E0089": "Cửa hàng không đủ điều kiện tham gia chương trình",
  "E0090": "Cửa hàng chưa tham gia chương trình",
  "E0091": "Cửa hàng chưa được duyệt tham gia chương trình",
  "E0092": "Thời gian đăng ký không hợp lệ",
  "E0093": "Thời gian hiện tại không nằm trong thời gian trả thưởng của chương trình",
  "E0094": "{parameter} đang tồn tại trong bộ giao KPI đang hoạt động.",
  "E0095": "Không thể đồng bộ Loại dữ liệu dùng chung này.",
  "E0096": "Tạo mới hoặc cập nhật {parameter} thất bại.",
  "E0097": "Bạn chưa thực hiện cấu hình chấm công!",
  "E0098": "Bộ chỉ tiêu đã được giao cho {parameter}!",
  "E0099": "Bộ chỉ tiêu {parameter} chưa hoạt động!",
  "E0100": "{parameter1} #{parameter2} chưa hoạt động!",
  "E0101": "tổng của chỉ tiêu Doanh số theo ngành hàng phải >= tổng các mục tiêu con ",
  "E0102": "Trạng thái không hợp lệ",
  "E0103": "{parameter1} {parameter2} chưa gán nhóm!",
  "E0104": "Cửa hàng {parameter1} đang có trong tuyến thực tế!",
  "E0105": "Bộ chỉ tiêu không hợp lệ",
  "E0106": "Bộ chỉ tiêu không tồn tại",
  "E0107": "Mã nhân viên {parameter1} không thuộc tuyến {parameter2}",
  "E0108": "NVTarget ở dòng {parameter1} không được để trống",
  "E0109": "Mã nhân viên {parameter1} ở dòng {parameter2} không tồn tại",
  "E0110": "Mã tuyến {parameter1} ở dòng {parameter2} không tồn tại",
  "E0111": "Nhân viên {parameter1} ở dòng {parameter2} đã tồn tại trong bộ KPI {parameter3}",
  "E0112": "Chỉ tiêu không tồn tại",
  "E0113": "IDTHANG ở dòng {parameter1} không được để trống",
  "E0114": "IDTHANG ở các dòng phải giống nhau",
  "E0115": "KpiGroupCode ở các dòng phải giống nhau",
  "E0116": "IDTHANG ở dòng {parameter1} không được nhỏ hơn tháng hiện tại",
  "E0117": "Không cho phép xuất báo cáo với dữ liệu lớn hơn {parameter1} dòng!",
  "E0118": "Vui lòng đợi tiến trình xuất file cho tài nguyên này hoàn thành trước khi tạo yêu cầu mới",
  "E0119": "Vui lòng đợi {parameter1} trước khi tạo yêu cầu xuất file mới đối với tài nguyên này",
  "E0120": "File import vượt quá số dòng cho phép (tối đa {parameter} dòng)!",
  "E0121": "Không được đồng bộ trong thời gian này. Vui lòng kiểm tra lại cấu hình.",
  "E0122": "Không có dữ liệu",
  "E0123": "Vui lòng chụp {parameter} checkin khi viếng thăm cửa hàng",
  "E0124": "Cập nhật EcomV2 với action {parameter} không thành công!",
  "E0125": "Không thể đổi trạng thái không hoạt động!Bộ quyền đã được gán cho người dùng!",
  "E0126": "Số lượng hình ảnh không hợp lệ!",
  "E0127": "Vượt quá số lần duyệt hình ảnh!",
  "E0128": "Thời gian chụp ảnh không hợp lệ!",
  "E0129": "Đã trao thưởng",
  "E0130": "Không thể trả thưởng",
  "E0131": "Duyệt đăng ký không thành công. Vui lòng thử lại!",
  "E0132": "Cửa hàng {parameter} không có tần suất",
  "E0133": "Thời gian duyệt hình ảnh không hợp lệ!",
  "E0134": "Đơn hàng đang được xử lý. Vui lòng kiểm tra lại.",
  "E0135": "Tạo Cửa hàng EcomV2 không thành công.",
  "E0136": "Screen code không hợp lệ",
  "E0137": "Tài sản không hợp lệ",
  "E0138": "QrCode không hợp lệ",
  "E0139": "Tài sản không trực thuộc {parameter}",
  "E0140": "Tài sản...",
  "E0141": "Tài sản...",
  "E0142": "Tài sản...",
  "E0143": "Bắt buộc nhập lý do",
  "E0144": "Lý do đề xuất ngưng hoạt động không đúng",
  "E0145": "Số lượng hình ảnh phải lớn hơn 0",
  "E0146": "Bạn đã tạo phiếu đề xuất ngưng hoạt động cho cửa hàng này, vui lòng kiểm tra lại!",
  "E0147": "{parameters} không hợp lệ",
  "E0148": "Không thế cập nhật khi trạng thái đã đã giải quyết hoặc đã từ chối.",
  "E0149": "Không tìm thấy {parameters}",
  "E0150": "Vui lòng checkin cửa hàng trước khi chọn lý do này!",
  "E0151": "Gửi yêu cầu thất bại vì '{parameters}', vui lòng thử lại!",
  "STATUS_CODE": {
    "400": "Yêu cầu không hợp lệ.",
    "401": "Tên đăng nhập hoặc mật khẩu không chính xác.",
    "402": "Mã này chưa được định nghĩa.",
    "403": "Truy cập bị từ chối.",
    "404": "Trang được yêu cầu không tồn tại.",
    "405": "Trang được yêu cầu không hỗ trợ method của request",
    "406": "Server chỉ có thể tạo một Response mà không được chấp nhận bởi Client.",
    "407": "Bạn phải xác nhận với một proxy server trước khi request này được phục vụ.",
    "408": "Request tốn thời gian dài hơn thời gian Server được chuẩn bị để đợi.",
    "409": "Quá nhiều yêu cầu đồng thời cho một file.",
    "410": "Giống 404 nhưng tài nguyên/trang cũng không tồn tại trong tương lai",
    "411": "Chưa định nghĩa trường “Content-Length” trong header của request gửi đi.",
    "412": "Server sẽ không đáp ứng một trong những điều kiện tiên quyết của Client trong Request.",
    "413": "Server sẽ không chấp nhận yêu cầu, bởi vì đối tượng yêu cầu là quá lớn.",
    "414": "URI được cung cấp là quá dài để Server xử lý.",
    "415": "Loại file của yêu cầu không được hỗ trợ.",
    "500": "Server xảy ra lỗi, vui lòng liên hệ admin",
    "501": "Server không hỗ trợ xử lý request này.",
    "502": "Máy chủ cố truy cập đang gửi lại lỗi.",
    "503": "Service hoặc file đang được yêu cầu hiện không có sẵn.",
    "504": "Server đã hết thời gian xử lý.",
    "505": "Giao thức HTTP yêu cầu không được hỗ trợ."
  }
}
